package com.fast.enums;

public enum ErrorEnum {

                     /* 异常定义说明 */
    /*--------------------------------------------------
    第一位大写字母：C客户端异常，如请求参数错误...
                  S服务端异常，如数据没查到...
                  O其它异常，如第三方服务调用失败...

    前两位数字：account模块异常：01
               record模块异常：02
               公用异常：00

    后三位数字：自增
    --------------------------------------------------*/

    //-----------------------------------------------------------------------------------------------------------------
    // 客户端异常，“ C ”开头
    //-----------------------------------------------------------------------------------------------------------------
    网络异常("C-00001","网络异常，请稍后再试！"),
    Token过期或已失效("C-00002", "The token has expired or become invalid"),

    //-----------------------------------------------------------------------------------------------------------------
    // 服务端异常，“ S ”开头
    //-----------------------------------------------------------------------------------------------------------------

    //-----------------------------------------------------------------------------------------------------------------
    // 其它异常（第三方服务调用失败），“ O ”开头
    //-----------------------------------------------------------------------------------------------------------------
    第三方请求超时("O-00001", "第三方服务超时，请稍后再试！"),
    无法找到实例("O-00002", "Unable to find instance"),
    ;

    /**
     * code
     */
    public final String code;

    /**
     * message
     */
    public final String message;

    ErrorEnum(String code, String message) {
        this.code = code;
        this.message = message;
    }

    public static String messageOf(String message){
        for (ErrorEnum e : ErrorEnum.values()) {
            if (e.message.equalsIgnoreCase(message)) {
                return e.code;
            }
        }
        return "-1";
    }
}
